; domain
(define (domain matching-bw-typed)
(:requirements :typing)
(:types block hand)
(:predicates (hand-positive ?h - hand)
             (hand-negative ?h - hand)
             (block-positive ?b - block)
             (block-negative ?b - block)
             (clear ?b - block)
             (on-table ?b - block)
             (empty ?h - hand)
             (holding ?h - hand ?b - block)
             (on ?b1 ?b2 - block)
	     (solid ?b - block)
             (notsolid ?b - block)
)
(:action pickup
  :parameters (?h - hand ?b - block)
  :precondition (and (clear ?b) (on-table ?b) (empty ?h))
  :effect (and (holding ?h ?b) (not (on-table ?b)) (not (clear ?b))
               (not (empty ?h))))
(:action putdown-pos-pos
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-positive ?h) (block-positive ?b))
  :effect (and (empty ?h) (on-table ?b) (clear ?b)
               (not (holding ?h ?b))))
(:action putdown-neg-neg
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-negative ?h) (block-negative ?b))
  :effect (and (empty ?h) (on-table ?b) (clear ?b)
               (not (holding ?h ?b))))
(:action putdown-pos-neg
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-positive ?h) (block-negative ?b))
  :effect (and (empty ?h) (on-table ?b) (clear ?b) (not (solid ?b))(notsolid ?b)
               (not (holding ?h ?b))))
(:action putdown-neg-pos
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-negative ?h) (block-positive ?b))
  :effect (and (empty ?h) (on-table ?b) (not (solid ?b))(notsolid ?b) (clear ?b)
               (not (holding ?h ?b))))
(:action stack-pos-pos
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-positive ?h) (block-positive ?b))
  :effect (and (empty ?h) (on ?b ?underb) (clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))
(:action stack-neg-neg
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-negative ?h) (block-negative ?b))
  :effect (and (empty ?h) (on ?b ?underb) (clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))
(:action stack-pos-neg
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-positive ?h) (block-negative ?b))
  :effect (and (empty ?h) (on ?b ?underb) (not (solid ?b)) (notsolid ?b)(clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))
(:action stack-neg-pos
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-negative ?h) (block-positive ?b))
  :effect (and (empty ?h) (on ?b ?underb) (not (solid ?b)) (notsolid ?b)(clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))

(:action unstack
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (on ?b ?underb) (clear ?b) (empty ?h))
  :effect (and (holding ?h ?b) (clear ?underb) (not (clear ?b))
               (not (on ?b ?underb)) (not (empty ?h))))
)

; problem
(define (problem matching-bw-typed-n10)
(:domain matching-bw-typed)
(:objects h1 h2 - hand 
b1 b2 b3 b4 b5 b6 b7 b8 b9 b10  - block)
(:INIT 
(block-negative b10) 
(block-negative b6) 
(block-negative b7) 
(block-negative b8) 
(block-negative b9) 
(block-positive b1) 
(block-positive b2) 
(block-positive b3) 
(block-positive b4) 
(block-positive b5) 
(clear b10)
(clear b3)
(clear b4)
(empty h2)
(hand-negative h2) 
(hand-positive h1) 
(holding h1 b2)
(on b1 b5)
(on b10 b8)
(on b3 b7)
(on b4 b6)
(on b6 b9)
(on b9 b1)
(on-table b5)
(on-table b7)
(on-table b8)
(solid b1)
(solid b10)
(solid b2)
(solid b3)
(solid b4)
(solid b5)
(solid b6)
(solid b7)
(solid b8)
(solid b9)
)
(:goal (and

 (on b2 b9)
 (on b5 b6)
 (on b6 b2)
 (on b7 b5)
 (on b8 b10)
 (on b9 b1)
 (on b10 b7)))
)

; plan
1. (putdown-pos-pos h1 b2)
   deleted: (holding h1 b2)
   added: (empty h1) (on-table b2) (clear b2)
   goals met: 1 of 7
2. (unstack h1 b4 b6)
   deleted: (clear b4) (on b4 b6) (empty h1)
   added: (holding h1 b4) (clear b6)
   goals met: 1 of 7
3. (unstack h2 b6 b9)
   deleted: (clear b6) (on b6 b9) (empty h2)
   added: (holding h2 b6) (clear b9)
   goals met: 1 of 7
4. (putdown-pos-pos h1 b4)
   deleted: (holding h1 b4)
   added: (empty h1) (on-table b4) (clear b4)
   goals met: 1 of 7
5. (stack-neg-neg h2 b6 b2)
   deleted: (clear b2) (holding h2 b6)
   added: (empty h2) (on b6 b2) (clear b6)
   goals met: 2 of 7
6. (unstack h2 b9 b1)
   deleted: (clear b9) (on b9 b1) (empty h2)
   added: (holding h2 b9) (clear b1)
   goals met: 1 of 7
7. (unstack h1 b1 b5)
   deleted: (clear b1) (on b1 b5) (empty h1)
   added: (holding h1 b1) (clear b5)
   goals met: 1 of 7
8. (stack-pos-pos h1 b1 b4)
   deleted: (clear b4) (holding h1 b1)
   added: (empty h1) (on b1 b4) (clear b1)
   goals met: 1 of 7
9. (stack-neg-neg h2 b9 b1)
   deleted: (clear b1) (holding h2 b9)
   added: (empty h2) (on b9 b1) (clear b9)
   goals met: 2 of 7
10. (unstack h2 b6 b2)
   deleted: (clear b6) (on b6 b2) (empty h2)
   added: (holding h2 b6) (clear b2)
   goals met: 1 of 7
11. (pickup h1 b2)
   deleted: (on-table b2) (clear b2) (empty h1)
   added: (holding h1 b2)
   goals met: 1 of 7
12. (stack-pos-pos h1 b2 b9)
   deleted: (clear b9) (holding h1 b2)
   added: (empty h1) (on b2 b9) (clear b2)
   goals met: 2 of 7
13. (pickup h1 b5)
   deleted: (on-table b5) (clear b5) (empty h1)
   added: (holding h1 b5)
   goals met: 2 of 7
14. (stack-neg-neg h2 b6 b2)
   deleted: (clear b2) (holding h2 b6)
   added: (empty h2) (on b6 b2) (clear b6)
   goals met: 3 of 7
15. (stack-pos-pos h1 b5 b6)
   deleted: (clear b6) (holding h1 b5)
   added: (empty h1) (on b5 b6) (clear b5)
   goals met: 4 of 7
16. (unstack h1 b3 b7)
   deleted: (clear b3) (on b3 b7) (empty h1)
   added: (holding h1 b3) (clear b7)
   goals met: 4 of 7
17. (pickup h2 b7)
   deleted: (on-table b7) (clear b7) (empty h2)
   added: (holding h2 b7)
   goals met: 4 of 7
18. (stack-neg-neg h2 b7 b5)
   deleted: (clear b5) (holding h2 b7)
   added: (empty h2) (on b7 b5) (clear b7)
   goals met: 5 of 7
19. (unstack h2 b10 b8)
   deleted: (clear b10) (on b10 b8) (empty h2)
   added: (holding h2 b10) (clear b8)
   goals met: 5 of 7
20. (stack-neg-neg h2 b10 b7)
   deleted: (clear b7) (holding h2 b10)
   added: (empty h2) (on b10 b7) (clear b10)
   goals met: 6 of 7
21. (pickup h2 b8)
   deleted: (on-table b8) (clear b8) (empty h2)
   added: (holding h2 b8)
   goals met: 6 of 7
22. (stack-neg-neg h2 b8 b10)
   deleted: (clear b10) (holding h2 b8)
   added: (empty h2) (on b8 b10) (clear b8)
   goals met: 7 of 7
